Public Attributes | List of all members
API_3DStyle Struct Reference
View Handling
3D Style parameters. More...
#include <APIdefs_Environment.h>
 Public Attributes
 GS::uchar_t  | name [API_UniLongNameLen]
The name of 3D Style. Must be unique within the project.
 Int32  | engineId
ID of 3D Rendering Engine.
 API_3DModelTypeID  | model3D
Image type of the 3D model (Block, Wireframe, Hidden Line, Shading)
 bool  | transparency
Transparency in shading is in effect or not.
 bool  | monochromeEnabled
Monochrome rendering mode, using one uniform color for all surfaces and another one for all contours.
 API_RGBColor  | monochromeSurfaceRGB
Color of all surfaces (ignored if monochromeEnabled is false)
 API_RGBColor  | monochromeContourRGB
Color of all contours (ignored if monochromeEnabled is false)
 bool  | bkgAsInRendering
Use the background specified previously in Photorendering Settings.
 bool  | chainBkgColors
Link sky and ground colors.
 API_RGBColor  | bkgSkyColor
Background sky color (ignored if bkgAsInRendering is true)
 API_RGBColor  | backGroundRGB
Background ground color (ignored if bkgAsInRendering is true)
 API_ShadingContoursID  | shadCont
Contour visibility options for shaded image mode.
 API_VectorShadowID  | vectSunShadow
Vectorial sun shadow generation options.
 bool  | vectHatchOn
Vectorial hatch patterns are used in analytic shaded mode.
 short  | contourThickness
Thickness of contour lines in pixels.
 short  | silhouetteThickness
Thickness of silhouette lines in pixels.
 short  | vectorialHatchingThickness
Thickness of vectorial hatching lines in pixels.
 short  | shadowContourThickness
Thickness of shadow contour lines in pixels.
 short  | castShadowPercent
Intensity of cast shadows.
 short  | shadingPercent
Intensity of shades.
 double  | shadowElevation
The absolute elevation of the horizontal plane on which the vectorial shadows will be generated. Valid only if vectSunShadow is either APIVectShad_ContOff_OneLevel or APIVectShad_ContOn_OneLevel.
 bool  | show3DHotSpotsOnly
Display also 2D hotspots in the 3D window.
Detailed Description
3D Style parameters.
Remarks
The API_3DStyle structure is used by the ACAPI_View_Get3DStyleList, the ACAPI_View_Get3DStyle and the ACAPI_View_Change3DStyle environment functions. Changing active style can be done using the ACAPI_View_SetCurrent3DStyle function. Changing the active style can be done using the ACAPI_View_SetCurrent3DStyle function. The range of values for all kinds of line thicknesses is [1..10]. The following settings are ignored using the OpenGL engine: vectHatchOn, silhouetteThickness, vectorialHatchingThickness, shadowContourThickness, castShadowPercent, shadingPercent.